In [1]:
import pandas as pd

# Pivot

In [2]:
df = pd.read_csv("weather123.csv")

In [3]:
df.pivot(index='city', columns='date', values='humidity')

date      5/1/2017  5/2/2017  5/3/2017
city
beijing         26        30        35
mumbai          80        83        85
new york        56        58        60

In [4]:
df.pivot(index='city', columns='date', values='temperature')

date      5/1/2017  5/2/2017  5/3/2017
city
beijing         80        77        79
mumbai          75        78        82
new york        65        66        68

In [5]:
bank = pd.read_csv("Bank_churn_modelling - Copy.csv")

In [6]:
bank.pivot(index="CustomerId", columns='Geography', values='Balance').head(10)

Geography     France   Germany      Spain
CustomerId
15565701         NaN       NaN  161993.89
15565706         NaN       NaN       0.00
15565714    64430.06       NaN        NaN
15565779         NaN  57809.32        NaN
15565796         NaN  96048.55        NaN
15565806        0.00       NaN        NaN
15565878         NaN       NaN       0.00
15565879        0.00       NaN        NaN
15565891        0.00       NaN        NaN
15565996        0.00       NaN        NaN

In [7]:
bank.pivot(index="RowNumber", columns='Geography', values='Age').head()

Geography  France  Germany  Spain
RowNumber
1            42.0      NaN    NaN
2             NaN      NaN   41.0
3            42.0      NaN    NaN
4            39.0      NaN    NaN
5             NaN      NaN   43.0

In [8]:
dates = ['2017-05-30', 'jan 5 2020', '05/03/2020']

In [9]:
out = pd.to_datetime(dates)
out

DatetimeIndex(['2017-05-30', '2020-01-05', '2020-05-03'], dtype='datetime64[ns]', freq=None)

In [10]:
age=[45,56,56,89.48,23,56]
age=pd.Series(age)
age

0    45.00
1    56.00
2    56.00
3    89.48
4    23.00
5    56.00
dtype: float64

# Sales Data

In [11]:
sales = pd.read_csv("sales-data.csv")
sales.head()

,Unnamed: 0,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month,City
0,0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001",4,Dallas (TX)
1,2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215",4,Boston (MA)
2,3,176560,Google Phone,1,600.00,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001",4,Los Angeles (CA)
3,4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001",4,Los Angeles (CA)
4,5,176561,Wired Headphones,1,11.99,04/30/19 09:27,"333 8th St, Los Angeles, CA 90001",4,Los Angeles (CA)

In [12]:
# What was the best month for sales? How much was earned?
sale_dates = pd.to_datetime(pd.Series(sales['Order Date']))

In [13]:
sales['Total Price'] = sales['Quantity Ordered'] * sales['Price Each']
sales.groupby(by='Month')['Total Price'].sum().sort_values(ascending=False).head(1)

Month
12    4.613443e+06
Name: Total Price, dtype: float64

In [14]:
# What city sold the most product
sales.groupby(by='City')['Quantity Ordered'].sum().sort_values(ascending=False).head(1)

City
San Francisco  (CA)    50239
Name: Quantity Ordered, dtype: int64

In [15]:
# What time should we display ads to maximize 
# the likelihood of customer buying the product
sales['Hour'] = pd.to_datetime(sales['Order Date']).dt.hour
sales.groupby(by='Hour')['Quantity Ordered'].sum().sort_values(ascending=False).head(1)

Hour
19    14470
Name: Quantity Ordered, dtype: int64

In [106]:
# What products are often sold together?
many_purchases = sales[ sales['Order ID'].duplicated(keep=False) ][['Order ID', 'Product']]
many_purchases.groupby(['Order ID'])['Product']

In [17]:
# What product sold the most? Why do you think it sold the most?
sales.groupby(by='Product')['Quantity Ordered'].sum().sort_values(ascending=False).head(1)

Product
AAA Batteries (4-pack)    31017
Name: Quantity Ordered, dtype: int64

In [18]:
# It is a consumable and other products will require it in order to function.